retrieve-sequence.xml

<?xml version="1.0" encoding="UTF-8"?>
	<env:Envelope xmlns:env="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
		<env:Header>
			<SessionHeader xmlns="http://soap.sforce.com/2006/04/metadata">
				<sessionId>00Di0000000KpdA!ARQAQJ6GGumKzJ3pghSpw8MWR6g6UpcqzRDVh.gL_oShwRf_sLtQjs0OoUT1PMlZj1UuxVshFz1aAOMJOAdmNfZHSIqXaWhD</sessionId>
			</SessionHeader>
		</env:Header>
		<env:Body>
			<m:retrieve xmlns:m="http://soap.sforce.com/2006/04/metadata" xmlns:sobj="null">
				<m:retrieveRequest>
					<m:apiVersion>28.0</m:apiVersion>
					<m:singlePackage>false</m:singlePackage>
					<m:unpackaged xsi:type="m:Package">
						<m:types>
							<m:members>*</m:members>
							<m:name>CustomObject</m:name>
						</m:types>
						<m:types>
							<m:members>*</m:members>
							<m:name>ConnectedApp</m:name>
						</m:types>
						<m:version>28.0</m:version>
					</m:unpackaged>
				</m:retrieveRequest>
			</m:retrieve>
		</env:Body>
	</env:Envelope>



<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns="http://soap.sforce.com/2006/04/metadata">
	<soapenv:Body>
		<retrieveResponse>
			<result>
				<done>false</done>
				<id>09Si0000000LL9HEAW</id>
				<numberComponentErrors>0</numberComponentErrors>
				<numberComponentsDeployed>0</numberComponentsDeployed>
				<numberComponentsTotal>0</numberComponentsTotal>
				<numberTestErrors>0</numberTestErrors>
				<numberTestsCompleted>0</numberTestsCompleted>
				<numberTestsTotal>0</numberTestsTotal>
				<state>InProgress</state>
			</result>
		</retrieveResponse>
	</soapenv:Body>
</soapenv:Envelope>




<env:Envelope xmlns:env="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
	<env:Header>
		<SessionHeader xmlns="http://soap.sforce.com/2006/04/metadata">
			<sessionId>00Di0000000KpdA!ARQAQJ6GGumKzJ3pghSpw8MWR6g6UpcqzRDVh.gL_oShwRf_sLtQjs0OoUT1PMlZj1UuxVshFz1aAOMJOAdmNfZHSIqXaWhD</sessionId>
		</SessionHeader>
	</env:Header>
	<env:Body>
		<m:checkStatus xmlns:m="http://soap.sforce.com/2006/04/metadata" xmlns:sobj="null">
			<m:asyncProcessId>09Si0000000LL9HEAW</m:asyncProcessId>
		</m:checkStatus>
	</env:Body>
</env:Envelope>




<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns="http://soap.sforce.com/2006/04/metadata">
	<soapenv:Body>
		<checkStatusResponse>
			<result>
				<done>true</done>
				<id>09Si0000000LL9HEAW</id>
				<numberComponentErrors>0</numberComponentErrors>
				<numberComponentsDeployed>0</numberComponentsDeployed>
				<numberComponentsTotal>0</numberComponentsTotal>
				<numberTestErrors>0</numberTestErrors>
				<numberTestsCompleted>0</numberTestsCompleted>
				<numberTestsTotal>0</numberTestsTotal>
				<state>Completed</state>
				<stateDetailLastModifiedDate>2013-06-21T22:27:54.000Z</stateDetailLastModifiedDate>
			</result>
		</checkStatusResponse>
	</soapenv:Body>
</soapenv:Envelope>




<env:Envelope xmlns:env="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
	<env:Header>
		<SessionHeader xmlns="http://soap.sforce.com/2006/04/metadata">
			<sessionId>00Di0000000KpdA!ARQAQJ6GGumKzJ3pghSpw8MWR6g6UpcqzRDVh.gL_oShwRf_sLtQjs0OoUT1PMlZj1UuxVshFz1aAOMJOAdmNfZHSIqXaWhD</sessionId>
		</SessionHeader>
	</env:Header>
	<env:Body>
		<m:checkRetrieveStatus xmlns:m="http://soap.sforce.com/2006/04/metadata" xmlns:sobj="null">
			<m:asyncProcessId>09Si0000000LL9HEAW</m:asyncProcessId>
		</m:checkRetrieveStatus>
	</env:Body>
</env:Envelope>




<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns="http://soap.sforce.com/2006/04/metadata">
	<soapenv:Body>
		<checkRetrieveStatusResponse>
			<result>
				<fileProperties>
					<createdById>005i0000000NsyKAAS</createdById>
					<createdByName>Dave Carroll</createdByName>
					<createdDate>2013-06-21T21:06:02.000Z</createdDate>
					<fileName>unpackaged/objects/Freddyss__c.object</fileName>
					<fullName></fullName>
					<id>01Ii0000000GWfaEAG</id>
					<lastModifiedById>005i0000000NsyKAAS</lastModifiedById>
					<lastModifiedByName>Dave Carroll</lastModifiedByName>
					<lastModifiedDate>2013-06-21T21:06:02.000Z</lastModifiedDate>
					<manageableState>unmanaged</manageableState>
					<type>CustomObject</type>
				</fileProperties>
				<fileProperties>
					<createdById>005i0000000NsyKAAS</createdById>
					<createdByName>Dave Carroll</createdByName>
					<createdDate>2013-06-21T20:14:03.000Z</createdDate>
					<fileName>unpackaged/objects/George__c.object</fileName>
					<fullName></fullName>
					<id>01Ii0000000GWSOEA4</id>
					<lastModifiedById>005i0000000NsyKAAS</lastModifiedById>
					<lastModifiedByName>Dave Carroll</lastModifiedByName>
					<lastModifiedDate>2013-06-21T20:14:03.000Z</lastModifiedDate>
					<manageableState>unmanaged</manageableState>
					<type>CustomObject</type>
				</fileProperties>
				<fileProperties>
					<createdById>005i0000000NsyKAAS</createdById>
					<createdByName>Dave Carroll</createdByName>
					<createdDate>2013-06-21T21:04:47.000Z</createdDate>
					<fileName>unpackaged/objects/Freddys__c.object</fileName>
					<fullName></fullName><id>01Ii0000000GWfVEAW</id>
					<lastModifiedById>005i0000000NsyKAAS</lastModifiedById>
					<lastModifiedByName>Dave Carroll</lastModifiedByName>
					<lastModifiedDate>2013-06-21T21:04:47.000Z</lastModifiedDate>
					<manageableState>unmanaged</manageableState>
					<type>CustomObject</type>
				</fileProperties>
				<fileProperties>
					<createdById>005i0000000NsyKAAS</createdById>
					<createdByName>Dave Carroll</createdByName>
					<createdDate>2013-06-21T20:16:20.000Z</createdDate>
					<fileName>unpackaged/objects/Fredd__c.object</fileName>
					<fullName></fullName><id>01Ii0000000GWSYEA4</id>
					<lastModifiedById>005i0000000NsyKAAS</lastModifiedById>
					<lastModifiedByName>Dave Carroll</lastModifiedByName>
					<lastModifiedDate>2013-06-21T20:16:20.000Z</lastModifiedDate>
					<manageableState>unmanaged</manageableState>
					<type>CustomObject</type>
				</fileProperties>
				<fileProperties>
					<createdById>005i0000000NsyKAAS</createdById>
					<createdByName>Dave Carroll</createdByName>
					<createdDate>2013-05-14T20:16:02.000Z</createdDate>
					<fileName>unpackaged/objects/Todo__c.object</fileName>
					<fullName></fullName><id>01Ii0000000FXDrEAO</id>
					<lastModifiedById>005i0000000NsyKAAS</lastModifiedById>
					<lastModifiedByName>Dave Carroll</lastModifiedByName>
					<lastModifiedDate>2013-05-14T20:16:02.000Z</lastModifiedDate>
					<manageableState>unmanaged</manageableState>
					<type>CustomObject</type>
				</fileProperties>
				<fileProperties>
					<createdById>005i0000000NsyKAAS</createdById>
					<createdByName>Dave Carroll</createdByName>
					<createdDate>2013-06-21T20:15:37.000Z</createdDate>
					<fileName>unpackaged/objects/Fred__c.object</fileName>
					<fullName></fullName><id>01Ii0000000GWSTEA4</id>
					<lastModifiedById>005i0000000NsyKAAS</lastModifiedById>
					<lastModifiedByName>Dave Carroll</lastModifiedByName>
					<lastModifiedDate>2013-06-21T20:15:37.000Z</lastModifiedDate>
					<manageableState>unmanaged</manageableState>
					<type>CustomObject</type>
				</fileProperties>
				<fileProperties>
					<createdById>005i0000000NsyKAAS</createdById>
					<createdByName>Dave Carroll</createdByName>
					<createdDate>2013-06-21T20:32:16.000Z</createdDate>
					<fileName>unpackaged/objects/Freddy__c.object</fileName>
					<fullName></fullName><id>01Ii0000000GWWlEAO</id>
					<lastModifiedById>005i0000000NsyKAAS</lastModifiedById>
					<lastModifiedByName>Dave Carroll</lastModifiedByName>
					<lastModifiedDate>2013-06-21T20:32:16.000Z</lastModifiedDate>
					<manageableState>unmanaged</manageableState>
					<type>CustomObject</type>
				</fileProperties>
				<fileProperties>
					<createdById>005i0000000NsyKAAS</createdById>
					<createdByName>Dave Carroll</createdByName>
					<createdDate>2013-06-21T22:27:54.506Z</createdDate>
					<fileName>unpackaged/package.xml</fileName>
					<fullName>unpackaged/package.xml</fullName>
					<id></id>
					<lastModifiedById>005i0000000NsyKAAS</lastModifiedById>
					<lastModifiedByName>Dave Carroll</lastModifiedByName>
					<lastModifiedDate>2013-06-21T22:27:54.506Z</lastModifiedDate>
					<manageableState>unmanaged</manageableState>
					<type>Package</type>
				</fileProperties>
				<id>09Si0000000LL9HEAW</id>
				<zipFile></zipFile>
			</result>
		</checkRetrieveStatusResponse>
	</soapenv:Body>
</soapenv:Envelope>



<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns="http://soap.sforce.com/2006/04/metadata">
<soapenv:Body>
<checkRetrieveStatusResponse>
<result>
<fileProperties>
<createdById>005i0000000NsyKAAS</createdById>
<createdByName>Dave Carroll</createdByName>
<createdDate>2013-06-21T23:10:24.612Z</createdDate>
<fileName>unpackaged/package.xml</fileName>
<fullName>unpackaged/package.xml</fullName>
<id></id>
<lastModifiedById>005i0000000NsyKAAS</lastModifiedById>
<lastModifiedByName>Dave Carroll</lastModifiedByName>
<lastModifiedDate>2013-06-21T23:10:24.612Z</lastModifiedDate>
<manageableState>unmanaged</manageableState>
<type>Package</type>
</fileProperties>
<id>09Si0000000LLBSEA4</id>
<zipFile>UEsDBBQACAAIAEy51UIAAAAAAAAAAAAAAAAWAAAAdW5wYWNrYWdlZC9wYWNrYWdlLnhtbE1OywrCMBC85ytCjoLZWESKbFNE8OxBPyCmqxbNgyaI/r2lD3ROM7vDzGD9dk/+oi61wVdiJZXg5G1oWn+rxPl0WJai1gyPxj7MjXjv9qkS95zjFiAFE2W6hs6StMFBodQG1BocZdOYbIRmvAfmT6Q08kE7cpe+Ui8QZvp7euNI74P3ZDM1uxgRhtMYBX9ZOO3WRSkVwqwYwjRXsy9QSwcIM9KCWZ0AAADgAAAAUEsBAhQAFAAIAAgATLnVQjPSglmdAAAA4AAAABYAAAAAAAAAAAAAAAAAAAAAAHVucGFja2FnZWQvcGFja2FnZS54bWxQSwUGAAAAAAEAAQBEAAAA4QAAAAAA</zipFile>
</result>
</checkRetrieveStatusResponse>
</soapenv:Body>
</soapenv:Envelope>
